app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "NickyMouse"], ["body", "NickyMouseNickyMouseNickyMouse"], ["user_id", 2], ["created_at", "2017-11-18 12:45:54.993672"], ["updated_at", "2017-11-18 12:45:54.993672"]]
---
  def create
  	@post = current_user.posts.build(post_params)
  	if @post.save